// Оператор spread в JavaScript





// Задача №1


// Найдите с помощью приведенной функции сумму элементов массива.

let arr = [1, 2, 3, 4, 5];

function func(num1, num2, num3, num4, num5) {
	return num1 + num2 + num3 + num4 + num5;
}


console.log(func(...arr)) // оператор spread





// Задача №2


function func(n1, n2, n3, n4, n5, n6, n7, n8) {
	return (n1 + n2 + n3 + n4) * (n5 + n6 + n7 + n8);
}

console.log( func(1, ...[2, 3, 4], 5, ...[6], ...[7, 8]) ); // 260










// Задача №3

// Дан массив с числами. Используя Math.min 
// и spread выведите на экран минимальное значение массива.






let arr = [1, 2, 3, 4, 5,6,7,8,9];

let max = Math.min(...arr)

console.log(max)




// ---------------------------------------------------------------




// Оператор spread и слияние массивов





// Задача №4



let arr1 = [1, 2, 3];
let arr2 = [4, 5, 6];

let arr  = ['a', ...arr1, 'b', 'c', ...arr2];

console.log(arr);       // 'a', 1, 2, 3, b, c, 4, 5, 6












// Задача №5 

let arr1 = [1, 2, 3];
let arr2 = [4, 5, 6];

let arr  = ['a', ...arr1, ...arr1, 'b', 'c'];
console.log(arr)  // a, 1, 2, 3, 1, 2, 3, b, c











// Задача №6


let arr1 = [1, 2, 3];
let arr2 = [...arr1, 4, 5, 6];

let arr  = ['a', 'b', 'c', ...arr2];
console.log(arr); // a, b, c, 1, 2, 3, 4, 5, 6













// Задача №7


let arr1 = [1, 2, 3];
let arr2 = [...arr1, 4, 5, 6];
let arr3 = [...arr2, 7, 8, 9];

let arr  = [0, ...arr3];
console.log(arr); // 0, 1, 2, 3, 4, 5, 6, 7, 8 ,9,









// Задача №8


let arr1 = [1, 2, 3];
let arr2 = [...arr1];

console.log(arr2); // 1, 2, 3






// --------------------------------------------------------------------------




// Оператор spread для строк и чисел в JavaScript **



// Задача №9


let arr = [...'12345'];
console.log(arr); // ["1", "2", "3", "4", "5"]









// Задача №10


let arr = ['a', ...'12345'];
console.log(arr); // ['a', '1', '2', '3', '4', '5']












// Задача №11



let arr = [...'12345', ...'56789'];
console.log(arr); // ['1', '2', '3', '4', '5', '6', '7', '8', '9']














// Задача №12


let arr1 = ['a', 'b', 'c'];
let arr2 = [...arr1, ...'12345'];

console.log(arr2); // ['a', 'b', 'c', '1', '2', '3', '4', '5']











// Оператор spread и числа



// Оператор spread не применим к числам:

let arr = [...12345]; // будет ошибка

// Для решения проблемы следует преобразовывать число в строку, вот так:

let arr = [...String(12345)]; // получится массив ['1', '2', '3', '4', '5'] 







































































